spec/vcr/SubscriptionsController/when_attempting_to_create_a_subscription_for_a_restricted_account/doesn_t_saves_the_subscription_in_the_database.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/products
    body:
      encoding: UTF-8
      string: name=Ampled+Support&type=service&statement_descriptor=Ampledband3
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.12.0
      Authorization:
      - Bearer sk_test_3RnBGRLSL1zbZa2ryzt82tjI
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.12.0","lang":"ruby","lang_version":"2.5.7 p206 (2019-10-01)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 5.3.0-51-generic (buildd@lgw01-amd64-034) (gcc version 9.2.1 20191008
        (Ubuntu 9.2.1-9ubuntu2)) #44-Ubuntu SMP Wed Apr 22 21:09:44 UTC 2020","hostname":"x260"}'
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - '30'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 May 2020 15:43:53 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '346'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_47bPINNOkbXoOD
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Stripe-Version:
      - '2019-02-11'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "prod_HCPrhLoiYOxpnI",
          "object": "product",
          "active": true,
          "attributes": [

          ],
          "created": 1588347833,
          "description": null,
          "images": [

          ],
          "livemode": false,
          "metadata": {
          },
          "name": "Ampled Support",
          "statement_descriptor": "Ampledband3",
          "type": "service",
          "unit_label": null,
          "updated": 1588347833
        }
    http_version: 
  recorded_at: Fri, 01 May 2020 15:43:53 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/products/prod_HCPrhLoiYOxpnI
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.12.0
      Authorization:
      - Bearer sk_test_3RnBGRLSL1zbZa2ryzt82tjI
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.12.0","lang":"ruby","lang_version":"2.5.7 p206 (2019-10-01)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 5.3.0-51-generic (buildd@lgw01-amd64-034) (gcc version 9.2.1 20191008
        (Ubuntu 9.2.1-9ubuntu2)) #44-Ubuntu SMP Wed Apr 22 21:09:44 UTC 2020","hostname":"x260"}'
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - '30'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 May 2020 15:43:54 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '346'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_QU1bgsy8WIKdTV
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Stripe-Version:
      - '2019-02-11'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "prod_HCPrhLoiYOxpnI",
          "object": "product",
          "active": true,
          "attributes": [

          ],
          "created": 1588347833,
          "description": null,
          "images": [

          ],
          "livemode": false,
          "metadata": {
          },
          "name": "Ampled Support",
          "statement_descriptor": "Ampledband3",
          "type": "service",
          "unit_label": null,
          "updated": 1588347833
        }
    http_version: 
  recorded_at: Fri, 01 May 2020 15:43:54 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/plans
    body:
      encoding: UTF-8
      string: product=prod_HCPrhLoiYOxpnI&nickname=Ampled+Support&interval=month&currency=usd&amount=15479
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.12.0
      Authorization:
      - Bearer sk_test_3RnBGRLSL1zbZa2ryzt82tjI
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.12.0","lang":"ruby","lang_version":"2.5.7 p206 (2019-10-01)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 5.3.0-51-generic (buildd@lgw01-amd64-034) (gcc version 9.2.1 20191008
        (Ubuntu 9.2.1-9ubuntu2)) #44-Ubuntu SMP Wed Apr 22 21:09:44 UTC 2020","hostname":"x260"}'
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - '30'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 May 2020 15:43:54 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '504'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_ZvZ76iXu00sv07
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Stripe-Version:
      - '2019-02-11'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "plan_HCPruHBE5lEUu3",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 15479,
          "amount_decimal": "15479",
          "billing_scheme": "per_unit",
          "created": 1588347834,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {
          },
          "nickname": "Ampled Support",
          "product": "prod_HCPrhLoiYOxpnI",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        }
    http_version: 
  recorded_at: Fri, 01 May 2020 15:43:55 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: customer=cus_FfMNyx9ktbGwnx
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.12.0
      Authorization:
      - Bearer sk_test_3RnBGRLSL1zbZa2ryzt82tjI
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.12.0","lang":"ruby","lang_version":"2.5.7 p206 (2019-10-01)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 5.3.0-51-generic (buildd@lgw01-amd64-034) (gcc version 9.2.1 20191008
        (Ubuntu 9.2.1-9ubuntu2)) #44-Ubuntu SMP Wed Apr 22 21:09:44 UTC 2020","hostname":"x260"}'
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - '30'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 May 2020 15:43:55 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '801'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_3Imf81kZo3ruGZ
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Stripe-Version:
      - '2019-02-11'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1Ge11rFObJENiB3bufi3szZ0",
          "object": "token",
          "card": {
            "id": "card_1Ge11rFObJENiB3b9sBVs5CN",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "currency": "usd",
            "cvc_check": null,
            "dynamic_last4": null,
            "exp_month": 5,
            "exp_year": 2021,
            "fingerprint": "xbttngdMsEUpSUHm",
            "funding": "debit",
            "last4": "5556",
            "metadata": {
            },
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "96.232.200.190",
          "created": 1588347835,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Fri, 01 May 2020 15:43:56 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: description=user%40ampled.com+for+Ampledband3&source=tok_1Ge11rFObJENiB3bufi3szZ0
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.12.0
      Authorization:
      - Bearer sk_test_3RnBGRLSL1zbZa2ryzt82tjI
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.12.0","lang":"ruby","lang_version":"2.5.7 p206 (2019-10-01)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 5.3.0-51-generic (buildd@lgw01-amd64-034) (gcc version 9.2.1 20191008
        (Ubuntu 9.2.1-9ubuntu2)) #44-Ubuntu SMP Wed Apr 22 21:09:44 UTC 2020","hostname":"x260"}'
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - '30'
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Fri, 01 May 2020 15:43:57 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '280'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_h7pHLn1Z1Bd8gc
      Stripe-Account:
      - acct_1GdkndFObJENiB3b
      Stripe-Version:
      - '2019-02-11'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your account cannot currently make charges. To find out why charge creation is currently disabled, look at the `requirements.disabled_reason` property on this account (/v1/accounts/acct_1GdkndFObJENiB3b).",
            "type": "invalid_request_error"
          }
        }
    http_version: 
  recorded_at: Fri, 01 May 2020 15:43:57 GMT
recorded_with: VCR 4.0.0
