spec/vcr/SubscriptionsController/when_creating_a_subscription/and_the_user_s_card_is_declined/returns_an_error.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/products
    body:
      encoding: UTF-8
      string: name=Ampled+Support&type=service&statement_descriptor=Ampledband
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.12.0
      Authorization:
      - Bearer sk_test_3RnBGRLSL1zbZa2ryzt82tjI
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.12.0","lang":"ruby","lang_version":"2.7.6 p137 (2020-10-01)","platform":"x86_64-darwin20","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ryans-Air 20.2.0 Darwin Kernel Version 20.2.0: Wed Dec  2 20:39:59 PST 2020;
        root:xnu-7195.60.75~1/RELEASE_X86_64 x86_64","hostname":"Ryans-Air"}'
      Stripe-Account:
      - acct_1FA1TnKB00tmjmII
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - '30'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 17 Feb 2021 04:43:32 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '345'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_FZF1f2RsLp9sxK
      Stripe-Account:
      - acct_1FA1TnKB00tmjmII
      Stripe-Version:
      - '2019-02-11'
      X-Stripe-C-Cost:
      - '3'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "prod_Ixd9oO1UGR4DbO",
          "object": "product",
          "active": true,
          "attributes": [

          ],
          "created": 1613537012,
          "description": null,
          "images": [

          ],
          "livemode": false,
          "metadata": {
          },
          "name": "Ampled Support",
          "statement_descriptor": "Ampledband",
          "type": "service",
          "unit_label": null,
          "updated": 1613537012
        }
    http_version:
  recorded_at: Wed, 17 Feb 2021 04:43:32 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/products/prod_Ixd9oO1UGR4DbO
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.12.0
      Authorization:
      - Bearer sk_test_3RnBGRLSL1zbZa2ryzt82tjI
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.12.0","lang":"ruby","lang_version":"2.7.6 p137 (2020-10-01)","platform":"x86_64-darwin20","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ryans-Air 20.2.0 Darwin Kernel Version 20.2.0: Wed Dec  2 20:39:59 PST 2020;
        root:xnu-7195.60.75~1/RELEASE_X86_64 x86_64","hostname":"Ryans-Air"}'
      Stripe-Account:
      - acct_1FA1TnKB00tmjmII
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - '30'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 17 Feb 2021 04:43:32 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '345'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_ZM6xRLPjwENVev
      Stripe-Account:
      - acct_1FA1TnKB00tmjmII
      Stripe-Version:
      - '2019-02-11'
      X-Stripe-C-Cost:
      - '3'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "prod_Ixd9oO1UGR4DbO",
          "object": "product",
          "active": true,
          "attributes": [

          ],
          "created": 1613537012,
          "description": null,
          "images": [

          ],
          "livemode": false,
          "metadata": {
          },
          "name": "Ampled Support",
          "statement_descriptor": "Ampledband",
          "type": "service",
          "unit_label": null,
          "updated": 1613537012
        }
    http_version:
  recorded_at: Wed, 17 Feb 2021 04:43:32 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/plans
    body:
      encoding: UTF-8
      string: product=prod_Ixd9oO1UGR4DbO&nickname=Ampled+Support&interval=month&currency=usd&amount=10330
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.12.0
      Authorization:
      - Bearer sk_test_3RnBGRLSL1zbZa2ryzt82tjI
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.12.0","lang":"ruby","lang_version":"2.7.6 p137 (2020-10-01)","platform":"x86_64-darwin20","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ryans-Air 20.2.0 Darwin Kernel Version 20.2.0: Wed Dec  2 20:39:59 PST 2020;
        root:xnu-7195.60.75~1/RELEASE_X86_64 x86_64","hostname":"Ryans-Air"}'
      Stripe-Account:
      - acct_1FA1TnKB00tmjmII
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - '30'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 17 Feb 2021 04:43:33 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '504'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_N97GciNL6RtGtq
      Stripe-Account:
      - acct_1FA1TnKB00tmjmII
      Stripe-Version:
      - '2019-02-11'
      X-Stripe-C-Cost:
      - '3'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "plan_Ixd9NAkDU0GsGg",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 10330,
          "amount_decimal": "10330",
          "billing_scheme": "per_unit",
          "created": 1613537012,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {
          },
          "nickname": "Ampled Support",
          "product": "prod_Ixd9oO1UGR4DbO",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        }
    http_version:
  recorded_at: Wed, 17 Feb 2021 04:43:33 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: customer=cus_FfMNyx9ktbGwnx
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.12.0
      Authorization:
      - Bearer sk_test_3RnBGRLSL1zbZa2ryzt82tjI
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.12.0","lang":"ruby","lang_version":"2.7.6 p137 (2020-10-01)","platform":"x86_64-darwin20","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ryans-Air 20.2.0 Darwin Kernel Version 20.2.0: Wed Dec  2 20:39:59 PST 2020;
        root:xnu-7195.60.75~1/RELEASE_X86_64 x86_64","hostname":"Ryans-Air"}'
      Stripe-Account:
      - acct_1FA1TnKB00tmjmII
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - '30'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 17 Feb 2021 04:43:33 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '801'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_o7hjZ213eRaiXZ
      Stripe-Account:
      - acct_1FA1TnKB00tmjmII
      Stripe-Version:
      - '2019-02-11'
      X-Stripe-C-Cost:
      - '15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1ILhsvKB00tmjmIInHfazvEL",
          "object": "token",
          "card": {
            "id": "card_1ILhsvKB00tmjmIIl1j91irT",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "currency": "usd",
            "cvc_check": null,
            "dynamic_last4": null,
            "exp_month": 5,
            "exp_year": 2021,
            "fingerprint": "xbttngdMsEUpSUHm",
            "funding": "debit",
            "last4": "5556",
            "metadata": {
            },
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "198.48.202.204",
          "created": 1613537013,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version:
  recorded_at: Wed, 17 Feb 2021 04:43:33 GMT
recorded_with: VCR 4.0.0
